realsosy/InfineonRacer/src/InfineonRacer_TC23xA/0_Src/1_SrvSw/SysSe/Comm/Ifx_Shell.c
/**
 * \file shell.c
 * \brief shell functions.
 *
 * \version iLLD_1_0_0_11_0
 * \copyright Copyright (c) 2013 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 */

//---------------------------------------------------------------------------
#include "Ifx_Shell.h"
#include "_Utilities/Ifx_Assert.h"
#include "Cpu/Std/IfxCpu_Intrinsics.h"

#include <string.h>
#include <stdlib.h>
#include <stdio.h>

#define IFX_SHELL_LLD              "%lld "
#define IFX_SHELL_LLX              "%llx "
#define IFX_SHELL_LLU              "%llu "

//---------------------------------------------------------------------------
#define IFX_SHELL_MAX_MESSAGE_SIZE 255
//---------------------------------------------------------------------------

/* Macro to detect space character */
#define ISSPACE(c)           (((c) == ' ') || ((c) == '\t'))

/* Macro to only execute parameter if echo is enabled for this shell */
#define IFX_SHELL_IF_ECHO(X) {if (shell->control.echo) {X; }}

/* Macro to write lots of spaces */
#define IFX_SHELL_WRITE_SPACES(X) \
    {int ii; for (ii = 0; ii < (X); ii++) {IfxStdIf_DPipe_print(shell->io, " "); }}

/* Macro to write lots of backspaces */
#define IFX_SHELL_WRITE_BACKSPACES(X) \
    {int ii; for (ii = 0; ii < (X); ii++) {IfxStdIf_DPipe_print(shell->io, "\b"); }}

//---------------------------------------------------------------------------
char Ifx_Shell_cmdBuffer[IFX_SHELL_CMD_LINE_SIZE * IFX_SHELL_CMD_HISTORY_SIZE];
//---------------------------------------------------------------------------
void Ifx_Shell_execute (Ifx_Shell * shell, pchar commandLine);
void Ifx_Shell_cmdEscapeProcess (Ifx_Shell * shell, char EscapeChar1, char EscapeChar2);

//---------------------------------------------------------------------------
/**
 * \brief Check whether the args is already at the end.
 * \param args The argument null-terminated string
 */
IFX_INLINE boolean Ifx_Shell_isEndOfLine (pchar args)
{
    return ((args == NULL_PTR) || (*args == IFX_SHELL_NULL_CHAR)) ? TRUE : FALSE;
}


static boolean Ifx_Shell_writeResult (Ifx_Shell * shell, Ifx_SizeT Code)
{
    Ifx_SizeT length = sizeof (Code);
    boolean result = IfxStdIf_DPipe_write (shell->io, &Code, &length, TIME_INFINITE);

    IFX_ASSERT (IFX_VERBOSE_LEVEL_ERROR, result != FALSE);

    return result;
}


//---------------------------------------------------------------------------
boolean Ifx_Shell_showHelpSingle (pchar prefix, const void *commandList, IfxStdIf_DPipe * io)
{
    const Ifx_Shell_Command *command = commandList;

    while (command->commandLine != NULL_PTR)
    {
        if ((prefix != NULL_PTR) && (prefix[0] != IFX_SHELL_NULL_CHAR))
        {
            IfxStdIf_DPipe_print (io, "%s ", prefix);
        }

        IfxStdIf_DPipe_print (io, command->commandLine);
        IfxStdIf_DPipe_print (io, command->help);
        IfxStdIf_DPipe_print (io, ENDL);
        command = &command[1];
    }

    return TRUE;
}


boolean Ifx_Shell_showHelp (pchar args, void *shellPtr, IfxStdIf_DPipe * io)
{
    sint32 i;
    Ifx_Shell *shell = shellPtr;

    (void) args;                /* ignore compiler warning */

    for (i = 0; i < IFX_SHELL_COMMAND_LISTS; i++)
    {
        if (shell->commandList[i] != NULL_PTR)
        {
            Ifx_Shell_showHelpSingle ("", shell->commandList[i], io);
        }
    }

    return TRUE;
}


boolean Ifx_Shell_protocolStart (pchar args, void *data, IfxStdIf_DPipe * io)
{
    Ifx_Shell *shell = data;
    boolean Result = TRUE;

    if (Ifx_Shell_matchToken (&args, "?") != FALSE)
    {
        IfxStdIf_DPipe_print (io, "Syntax     : protocol start" ENDL);
        IfxStdIf_DPipe_print (io, "           > start a protocol" ENDL);
    }
    else if (Ifx_Shell_matchToken (&args, "start") != FALSE)
    {
        if ((shell->protocol.start != NULL_PTR) && (shell->protocol.object != NULL_PTR))
        {
            Result = shell->protocol.start (shell->protocol.object, io);
            shell->protocol.started = (Result != FALSE);

            if (shell->protocol.onStart != NULL_PTR)
            {
                shell->protocol.onStart (shell->protocol.object, shell->protocol.onStartData);
            }
        }
        else
        {
            Result = FALSE;
        }
    }
    else
    {
    }

    return Result;
}


boolean Ifx_Shell_bbProtocolStart (pchar args, void *data, IfxStdIf_DPipe * io)
{
    boolean result = TRUE;

    if (Ifx_Shell_matchToken (&args, "?") != FALSE)
    {
        IfxStdIf_DPipe_print (io, "Syntax     : protocol start" ENDL);
        IfxStdIf_DPipe_print (io, "           > start a protocol" ENDL);
    }
    else if (Ifx_Shell_matchToken (&args, "protocol") != FALSE)
    {
        result = Ifx_Shell_protocolStart (args, data, io);
    }
    else
    {
    }

    return result;
}


//---------------------------------------------------------------------------
void Ifx_Shell_initConfig (Ifx_Shell_Config * config)
{
    uint32 i;

    for (i = 0; i < IFX_SHELL_COMMAND_LISTS; i++)
    {
        config->commandList[i] = NULL_PTR;
    }

    config->standardIo = NULL_PTR;
    config->echo = TRUE;
    config->protocol.execute = NULL_PTR;
    config->protocol.object = NULL_PTR;
    config->protocol.onStart = NULL_PTR;
    config->protocol.onStartData = NULL_PTR;
    config->protocol.start = NULL_PTR;
    config->protocol.started = FALSE;
    config->sendResultCode = FALSE;
    config->showPrompt = TRUE;
    config->standardIo = NULL_PTR;
}


boolean Ifx_Shell_init (Ifx_Shell * shell, const Ifx_Shell_Config * config)
{
    sint32 i;
    char **CmdHistory = NULL_PTR;   /* Pointer to array of pointers for command history items */

