realsosy/InfineonRacer/src/InfineonRacer_TC23xA/0_Src/1_SrvSw/SysSe/Comm/Ifx_Shell.c
    /* Ensure state variable is cleared */
    memset (shell, 0, sizeof (*shell));

    shell->protocol = config->protocol;
    shell->protocol.started = FALSE;

    shell->io = config->standardIo;
    shell->control.showPrompt = config->showPrompt;
    shell->control.sendResultCode = config->sendResultCode;
    shell->control.echo = config->echo;
    shell->control.echoError = TRUE;
    shell->control.enabled = TRUE;

    shell->locals.escBracketNum = IFX_SHELL_NULL_CHAR;  /* Used to cache number in sequence "ESC [ 1/2/3/4 ~" */
    shell->locals.cmdState = IFX_SHELL_CMD_STATE_NORMAL;

    /* Copy command line buffer pointer into state variable */
    shell->cmd.cmdStr = shell->locals.cmdStr;

    /* Initialize command history space and cache pointer */
    memset (Ifx_Shell_cmdBuffer, 0, sizeof (Ifx_Shell_cmdBuffer));
    shell->cmdHistory[0] = &Ifx_Shell_cmdBuffer[0];

    for (i = 0; i < IFX_SHELL_COMMAND_LISTS; i++)
    {
        shell->commandList[i] = config->commandList[i];
    }

    /* Initialize command history pointers */
    CmdHistory = shell->cmdHistory;

    for (i = 1; i < IFX_SHELL_CMD_HISTORY_SIZE; i++)
    {
        CmdHistory[i] = &CmdHistory[i - 1][IFX_SHELL_CMD_LINE_SIZE];    /* Items are just offsets into a large allocated area */
    }

    shell->cmd.historyItem = IFX_SHELL_CMD_HISTORY_NO_ITEM;

    /* Pre-load useful commands into history buffer */
    strcpy (CmdHistory[0], "help");
    strcpy (CmdHistory[1], "protocol start");

    if (shell->control.showPrompt != 0)
    {
        IfxStdIf_DPipe_print (shell->io, ENDL);
        IfxStdIf_DPipe_print (shell->io, IFX_SHELL_PROMPT);
    }

    return TRUE;
}


void Ifx_Shell_process (Ifx_Shell * shell)
{
    Ifx_SizeT i, j;             /* Loop variables */
    Ifx_SizeT count;
    Ifx_SizeT readCount;
    boolean NormalKeyPress;     /* Indicates if this is a normal keypress, i.e. not part of an escape code */

    Ifx_Shell_CmdLine *Cmd = &shell->cmd;
    char *inputbuffer = shell->locals.inputbuffer;
    char *cmdStr = shell->locals.cmdStr;
    char **CmdHistory = shell->cmdHistory;

    if (shell->control.enabled == 0)
    {
        return;
    }

    if ((shell->protocol.object != NULL_PTR) && (shell->protocol.started != FALSE))
    {
        shell->protocol.execute (shell->protocol.object);
    }
    else
    {
        /**** NORMAL MODE ****/

        /********************************************************************************/
        /* Read all characters until enter inclusive.                                   */
        /* If the command is bigger than IFX_SHELL_CMD_SIZE, the command is ignored.    */
        /*                                                                              */
        /* Escape sequences are handled by a state machine.                             */
        /* The following escape sequences (prefix "ESC [") are supported:               */
        /*                                                                              */
        /* A  - up      B - down       C - right     D - left                           */
        /* 1~ - HOME   2~ - INSERT    3~ - DELETE   5~ - END                            */
        /*                                                                              */
        /* Backspace ('\b') is also supported.                                          */
        /********************************************************************************/

        count = 0;
        readCount = IFX_SHELL_CMD_LINE_SIZE - count;
        IfxStdIf_DPipe_read (shell->io, &inputbuffer[count], &readCount, TIME_NULL);
        count += readCount;

        for (i = 0; i < count; i++)
        {
            /* By default, we assume character is part of escape sequence */
            NormalKeyPress = FALSE;

            /* Process key pressed */
            switch (inputbuffer[i])
            {
                /* New line (ENTER) */
            case '\n':
            case '\r':
                /* Print new line to terminal if requested */
                IFX_SHELL_IF_ECHO (IfxStdIf_DPipe_print (shell->io, ENDL))
                    /* Execute command if length is valid - i.e. not an over-full buffer
                     * (prevents attempted execution of junk) */
                    if (Cmd->length < IFX_SHELL_CMD_LINE_SIZE)
                {
                    cmdStr[Cmd->length] = IFX_SHELL_NULL_CHAR;  /* Terminate cmdStr */

                    if (Cmd->historyAdd != FALSE)
                    {
                        /* Shuffle history up */
                        for (j = IFX_SHELL_CMD_HISTORY_SIZE - 1; j > 0; j--)
                        {
                            /* Copy text */
                            strncpy (CmdHistory[j], CmdHistory[j - 1], IFX_SHELL_CMD_LINE_SIZE);
                        }

                        /* Copy in new entry */
                        strncpy (CmdHistory[0], cmdStr, IFX_SHELL_CMD_LINE_SIZE);
                    }

                    /* Execute command */
                    Ifx_Shell_execute (shell, cmdStr);
                }

                /* Show prompt if in main shell */
                if (shell->control.showPrompt != 0)
                {
                    IfxStdIf_DPipe_print (shell->io, IFX_SHELL_PROMPT);
                }

                /* Reset command line buffer length */
                Cmd->length = 0;

                /* Reset command line buffer cursor position */
                Cmd->cursor = 0;

                /* Clear flag */
                Cmd->historyAdd = FALSE;

                /* Ensure we're not in command history list */
                Cmd->historyItem = IFX_SHELL_CMD_HISTORY_NO_ITEM;
                break;

                /* Backspace (may occur in middle of text if cursor location is not at end) */
            case '\b':

                if (Cmd->cursor > 0)
                {
                    /* Update on screen */
                    if (shell->control.echo != 0)
                    {
                        /* Move left one character */
                        IfxStdIf_DPipe_print (shell->io, "\b");

                        /* Update line with new characters */
                        for (j = Cmd->cursor; j < Cmd->length; j++)
                        {
                            IfxStdIf_DPipe_print (shell->io, "%c", cmdStr[j]);
                        }

