realsosy/InfineonRacer/src/InfineonRacer_TC23xA/0_Src/1_SrvSw/SysSe/Comm/Ifx_Shell.c
                        /* Write over duplicated character at end */
                        IfxStdIf_DPipe_print (shell->io, " ");
                    IFX_SHELL_WRITE_BACKSPACES ((Cmd->length - Cmd->cursor) + 1)}

                    /* Update in command line variable. Shuffle text left */
                    strncpy (&cmdStr[Cmd->cursor - 1], &cmdStr[Cmd->cursor], Cmd->length - Cmd->cursor);

                    /* Terminate string at end of shorter string */
                    cmdStr[Cmd->length - 1] = IFX_SHELL_NULL_CHAR;

                    Cmd->length--;
                    Cmd->cursor--;

                    /* Command line has been modified */
                    Cmd->historyAdd = TRUE;
                }

                break;

                /* Escape character */
            case '\x1B':       /*'\x1B': */
                shell->locals.cmdState = IFX_SHELL_CMD_STATE_ESCAPE;
                break;

                /* '[' - check to see if this is second part of an escape sequence */
            case '[':

                if (shell->locals.cmdState == IFX_SHELL_CMD_STATE_ESCAPE)
                {
                    /* ESC [ pressed */
                    shell->locals.cmdState = IFX_SHELL_CMD_STATE_ESCAPE_BRACKET;
                }
                else
                {
                    NormalKeyPress = TRUE;
                }

                break;

                /* Check for supported characters in escape sequences ( ESC [ A/B/C/D ) */
            case 'A':
            case 'B':
            case 'C':
            case 'D':

                if (shell->locals.cmdState == IFX_SHELL_CMD_STATE_ESCAPE_BRACKET)
                {
                    /* Process arrow keys */
                    Ifx_Shell_cmdEscapeProcess (shell, inputbuffer[i], 0);

                    /* End of escape sequence */
                    shell->locals.cmdState = IFX_SHELL_CMD_STATE_NORMAL;
                }
                else
                {
                    NormalKeyPress = TRUE;
                }

                break;

                /* Check for supported characters in escape sequences (ESC [ 2/4/5 ~) */
            case '1':
            case '2':
            case '3':
            case '4':

                if (shell->locals.cmdState == IFX_SHELL_CMD_STATE_ESCAPE_BRACKET)
                {
                    /* Store number for use once complete escape sequence is confirmed (below) */
                    shell->locals.escBracketNum = inputbuffer[i];
                    shell->locals.cmdState = IFX_SHELL_CMD_STATE_ESCAPE_BRACKET_NUMBER;
                }
                else
                {
                    NormalKeyPress = TRUE;
                }

                break;

                /* Check for supported characters in escape sequences (ESC [ 2/4/5 ~) */
            case '~':

                if (shell->locals.cmdState == IFX_SHELL_CMD_STATE_ESCAPE_BRACKET_NUMBER)
                {
                    /* Process home/delete/end */
                    Ifx_Shell_cmdEscapeProcess (shell, shell->locals.escBracketNum, '~');

                    /* End of escape sequence */
                    shell->locals.cmdState = IFX_SHELL_CMD_STATE_NORMAL;
                }
                else
                {
                    NormalKeyPress = TRUE;
                }

                break;

                /* Normal character - add to command string */
            default:
                NormalKeyPress = TRUE;
                break;
            }

            IFX_ASSERT (IFX_VERBOSE_LEVEL_ERROR, Cmd->length >= Cmd->cursor);   /* Sanity check */

            /* If this was a normal key press (not part of an escape sequence),
             * add it to the command string */
            if (NormalKeyPress != FALSE)
            {
                /* Ensure state machine is reset */
                shell->locals.cmdState = IFX_SHELL_CMD_STATE_NORMAL;

                /* If not filled buffer, add in this character */
                if (Cmd->length < (IFX_SHELL_CMD_LINE_SIZE - 1))
                {
                    /* Command line has been modified */
                    Cmd->historyAdd = TRUE;

                    /* Copy into command line */
                    cmdStr[Cmd->cursor] = inputbuffer[i];
                    Cmd->cursor++;

                    /* Update length of buffer */
                    Cmd->length = __max (Cmd->length, Cmd->cursor);

                    if (shell->control.echo != 0)
                    {
                        /* echo character to shell output if requested */
                        shell->locals.echo[0] = inputbuffer[i];
                        IfxStdIf_DPipe_print (shell->io, shell->locals.echo);
                    }
                }
                else
                {
                    /* Line too long - ignore further characters */
                    Cmd->historyAdd = FALSE;    /* Invalid command line */
                }
            }
        }
    }
}


void Ifx_Shell_deinit (Ifx_Shell * shell)
{
    (void) shell;               /* ignore compiler warning; */
    // tbd free necessary memory
}


pchar Ifx_Shell_skipWhitespace (pchar args)
{
    if (args != NULL_PTR)
    {
        while ((*args != IFX_SHELL_NULL_CHAR) && (ISSPACE (*args)))
        {
            args = &args[1];
        }
    }

    return args;
}


boolean Ifx_Shell_matchToken (pchar * argsPtr, pchar token)
{
    pchar savedArguments = *argsPtr;
    char buffer[256];
    boolean result = FALSE;

    if (Ifx_Shell_parseToken (argsPtr, buffer, Ifx_COUNTOF (buffer)) != FALSE)
    {
        if (strcmp (token, buffer) == 0)
        {
            result = TRUE;
        }
    }

    if (result == FALSE)
    {
        // No match: don't advance pointer
        *argsPtr = savedArguments;
    }

    return result;
}


static boolean Ifx_Shell_matchCommand (pchar * argsPtr, pchar * match)
{
    boolean result = FALSE;
    pchar savedArguments = *argsPtr;
    pchar savedMatch = *match;
    char buffer0[256];
    char buffer1[256];

    if ((Ifx_Shell_parseToken (argsPtr, buffer0, Ifx_COUNTOF (buffer0)) != FALSE)
        && (Ifx_Shell_parseToken (match, buffer1, Ifx_COUNTOF (buffer1)) != FALSE))
    {
        if (strcmp (buffer1, buffer0) == 0)
        {
            result = TRUE;
        }
    }

    if (result == FALSE)
    {
        // No match: don't advance pointer
        *argsPtr = savedArguments;
        *match = savedMatch;
    }

    return result;
}


boolean Ifx_Shell_parseToken (pchar * argsPtr, char *tokenBuffer, int bufferLength)
{
    int mindex = 0;
    pchar args = Ifx_Shell_skipWhitespace (*argsPtr);

    tokenBuffer[0] = IFX_SHELL_NULL_CHAR;

    if (args == NULL_PTR)
    {
        return FALSE;
    }

    if (*args == '\"')
    {
        args = &args[1];

        while ((*args != IFX_SHELL_NULL_CHAR) && (*args != '\"'))
        {
            if (mindex < bufferLength)
            {
                tokenBuffer[mindex] = *args;
                mindex++;
            }

