realsosy/InfineonRacer/src/InfineonRacer_TC23xA/0_Src/1_SrvSw/SysSe/Comm/Ifx_Shell.c
            args = &args[1];
        }

        // error if no closing quote
        if (*args != '\"')
        {
            return FALSE;
        }

        args = &args[1];
    }
    else
    {
        // don't allow unquoted empty tokens
        if (*args == IFX_SHELL_NULL_CHAR)
        {
            return FALSE;
        }

        while ((*args != IFX_SHELL_NULL_CHAR) && (!ISSPACE (*args)))
        {
            if (mindex < bufferLength)
            {
                tokenBuffer[mindex] = *args;
                mindex++;
            }

            args = &args[1];
        }
    }

    // make sure string is zero terminated
    if (bufferLength > 0)
    {
        tokenBuffer[__min (mindex, bufferLength - 1)] = IFX_SHELL_NULL_CHAR;
    }

    *argsPtr = Ifx_Shell_skipWhitespace (args);

    return TRUE;
}


boolean Ifx_Shell_parseAddress (pchar * argsPtr, void **address)
{
    char buffer[32];
    boolean result;

    *address = 0;

    if (Ifx_Shell_parseToken (argsPtr, buffer, Ifx_COUNTOF (buffer)) == FALSE)
    {
        result = FALSE;
    }
    else
    {
        result = (buffer[0] != IFX_SHELL_NULL_CHAR) && (sscanf (buffer, "%x ", (unsigned int *) address) == 1);
    }

    return result;
}


boolean Ifx_Shell_parseSInt32 (pchar * argsPtr, sint32 * value)
{
    sint64 value64;
    boolean result;

    *value = 0;

    if (Ifx_Shell_parseSInt64 (argsPtr, &value64) == FALSE)
    {
        result = FALSE;
    }
    else
    {
        *value = (sint32) value64;
        result = TRUE;
    }

    return result;
}


boolean Ifx_Shell_parseUInt32 (pchar * argsPtr, uint32 * value, boolean hex)
{
    uint64 value64;
    boolean result;

    *value = 0;

    if (Ifx_Shell_parseUInt64 (argsPtr, &value64, hex) == FALSE)
    {
        result = FALSE;
    }
    else
    {
        *value = (uint32) value64;
        result = TRUE;
    }

    return result;
}


boolean Ifx_Shell_parseSInt64 (pchar * argsPtr, sint64 * value)
{
    char buffer[64];
    boolean result;

    *value = 0;

    if (Ifx_Shell_parseToken (argsPtr, buffer, Ifx_COUNTOF (buffer)) == FALSE)
    {
        result = FALSE;
    }
    else
    {
        result = (buffer[0] != IFX_SHELL_NULL_CHAR) && (sscanf (buffer, IFX_SHELL_LLD, value) == 1);
    }

    return result;
}


boolean Ifx_Shell_parseUInt64 (pchar * argsPtr, uint64 * value, boolean hex)
{
    char buffer[64];
    boolean result;

    *value = 0;

    if (Ifx_Shell_parseToken (argsPtr, buffer, Ifx_COUNTOF (buffer)) == FALSE)
    {
        result = FALSE;
    }
    else
    {
        char *bufferPointer = buffer;

        if ((buffer[0] == '0') && (buffer[1] == 'x'))
        {
            bufferPointer = &bufferPointer[2];
            hex = TRUE;
        }

        if (hex != FALSE)
        {
            result = (bufferPointer[0] != IFX_SHELL_NULL_CHAR) && (sscanf (bufferPointer, IFX_SHELL_LLX, value) == 1);
        }
        else
        {
            result = (bufferPointer[0] != IFX_SHELL_NULL_CHAR) && (sscanf (bufferPointer, IFX_SHELL_LLU, value) == 1);
        }
    }

    return result;
}


boolean Ifx_Shell_parseFloat64 (pchar * argsPtr, float64 * value)
{
    char buffer[64];
    boolean result;

    *value = 0;

    if (Ifx_Shell_parseToken (argsPtr, buffer, Ifx_COUNTOF (buffer)) == FALSE)
    {
        result = FALSE;
    }
    else
    {
        result = (buffer[0] != IFX_SHELL_NULL_CHAR) && (sscanf (buffer, "%lf ", value) == 1);
    }

    return result;
}


boolean Ifx_Shell_parseFloat32 (pchar * argsPtr, float32 * value)
{
    char buffer[64];
    boolean result;

    *value = 0;

    if (Ifx_Shell_parseToken (argsPtr, buffer, Ifx_COUNTOF (buffer)) == FALSE)
    {
        result = FALSE;
    }
    else
    {
        result = (buffer[0] != IFX_SHELL_NULL_CHAR) && (sscanf (buffer, "%f ", value) == 1);
    }

    return result;
}


const Ifx_Shell_Command *Ifx_Shell_commandFind (const Ifx_Shell_Command * commandList, pchar commandLine, pchar * args)
{
    const Ifx_Shell_Command *command = commandList;
    const Ifx_Shell_Command *result = NULL_PTR;

    while (command->commandLine != NULL_PTR)
    {
        pchar commandTemp = (pchar) command->commandLine;
        pchar commandLineTemp = commandLine;
        char buffer[256];
        boolean commandFound = FALSE;

        while (Ifx_Shell_matchCommand (&commandLineTemp, &commandTemp) != FALSE)
        {
            commandFound = TRUE;
        }

        if ((commandFound != FALSE) && (Ifx_Shell_parseToken (&commandTemp, buffer, Ifx_COUNTOF (buffer)) == FALSE))
        {
            *args = commandLineTemp;
            result = command;
            break;
        }

        command = &command[1];
    }

    return result;
}


const Ifx_Shell_Command *Ifx_Shell_commandListFind (Ifx_Shell * shell, pchar commandLine, pchar * args)
{
    int i;
    const Ifx_Shell_Command *shellCommand = NULL_PTR;

    for (i = 0; i < IFX_SHELL_COMMAND_LISTS; i++)
    {
        if (shell->commandList[i] != NULL_PTR)
        {
            shellCommand = Ifx_Shell_commandFind (shell->commandList[i], commandLine, args);

            if (shellCommand != NULL_PTR)
            {
                break;
            }
        }
    }

    return shellCommand;
}


void Ifx_Shell_execute (Ifx_Shell * shell, pchar commandLine)
{
    pchar args = NULL_PTR;
    const Ifx_Shell_Command *shellCommand = Ifx_Shell_commandListFind (shell, commandLine, &args);

    if (shellCommand != NULL_PTR)
    {
        if (shellCommand->call (args, shellCommand->data, shell->io) != FALSE)
        {
            if (shell->control.sendResultCode != 0)
            {
                Ifx_Shell_writeResult (shell, Ifx_Shell_ResultCode_ok);
            }
        }
        else
        {
            if (shell->control.sendResultCode != 0)
            {
                Ifx_Shell_writeResult (shell, Ifx_Shell_ResultCode_nok);
            }
            else if (shell->control.echoError != 0)
            {
                IfxStdIf_DPipe_print (shell->io, "\r\nShell command error: %s" ENDL, commandLine);
            }
            else
            {
            }
        }
    }
    else
    {
        if (commandLine[0] != IFX_SHELL_NULL_CHAR)
        {
            if (shell->control.sendResultCode != 0)
            {
                Ifx_Shell_writeResult (shell, Ifx_Shell_ResultCode_unknown);
            }
            else if (shell->control.echoError != 0)
            {
                IfxStdIf_DPipe_print (shell->io, "\r\nUnknown command: %s" ENDL, commandLine);
            }
            else
            {
            }
        }
    }
}


/****************************************************************************************/
/* Processes escape sequences, including handling command history.                      */
/* The following escape sequences (prefix "ESC [") are supported:                       */
/* A - up     B - down      C - right     D - left                                      */
/* 1~ - HOME  2~ - INSERT   3~ - DELETE   4~ - END                                      */
/*                                                                                      */
/* Parameters:                                                                          */
/*      EscapeChar1 - First character to follow ESC [                                   */
/*      EscapeChar2 - Second character following ESC [ , if applicable                  */
/*                                                                                      */
/****************************************************************************************/
void Ifx_Shell_cmdEscapeProcess (Ifx_Shell * shell, char EscapeChar1, char EscapeChar2)
{
    Ifx_Shell_CmdLine *Cmd = NULL_PTR;  /* Command line editing state */
    char *cmdStr = NULL_PTR;    /* Cached pointer to command line being edited */
    sint32 i = 0;               /* Loop variable */

    /* Validate parameters */
    boolean result = (shell != NULL_PTR);

