realsosy/InfineonRacer/src/InfineonRacer_TC23xA/0_Src/1_SrvSw/SysSe/Comm/Ifx_Shell.c
    IFX_ASSERT (IFX_VERBOSE_LEVEL_ERROR, result != FALSE);

    if (result == FALSE)
    {
        return;                 /* ERROR CASE - no thread data available! */
    }

    /* Cache command state and command line pointer */
    Cmd = &shell->cmd;
    cmdStr = Cmd->cmdStr;

    /* Validate command line state */
    IFX_ASSERT (IFX_VERBOSE_LEVEL_ERROR, cmdStr != NULL_PTR);
    IFX_ASSERT (IFX_VERBOSE_LEVEL_ERROR, Cmd->cursor < IFX_SHELL_CMD_LINE_SIZE);
    IFX_ASSERT (IFX_VERBOSE_LEVEL_ERROR, Cmd->length < IFX_SHELL_CMD_LINE_SIZE);

    /* Switch on first character after ESC [ */
    switch (EscapeChar1)
    {
    case 'A':                  /* Up arrow */

        if (Cmd->historyItem == IFX_SHELL_CMD_HISTORY_NO_ITEM)
        {
            /* Not using list at the moment - take most recent item [0] */
            Cmd->historyItem = 0;
        }
        else
        {
            if (Cmd->historyItem < (IFX_SHELL_CMD_HISTORY_SIZE - 1))
            {
                /* If not already at oldest, go back one in list */
                Cmd->historyItem++;
            }
        }

        /* Copy text into buffer */
        strncpy (cmdStr, shell->cmdHistory[Cmd->historyItem], IFX_SHELL_CMD_LINE_SIZE);

        /* echo to screen if requested */
        if (shell->control.echo != 0)
        {
            IFX_SHELL_WRITE_BACKSPACES (Cmd->cursor)    /* Move cursor back to start */
                IFX_SHELL_WRITE_SPACES (Cmd->length)    /* Overwrite text with spaces */
                IFX_SHELL_WRITE_BACKSPACES (Cmd->length)    /* Move cursor back to start */
                IfxStdIf_DPipe_print (shell->io, cmdStr);   /* Copy buffer to screen */
        }

        Cmd->cursor = (Ifx_SizeT) strlen (cmdStr);  /* Store cursor position */
        Cmd->length = Cmd->cursor;  /* Store command line length */
        Cmd->historyAdd = FALSE;    /* Don't add back to history unless modified */
        break;

    case 'B':                  /* Down arrow */

        if ((Cmd->historyItem == IFX_SHELL_CMD_HISTORY_NO_ITEM) || (Cmd->historyItem == 0))
        {
            /* Not using list at the moment, or have dropped off the end - just clear command line */
            if (shell->control.echo != 0)
            {
                IFX_SHELL_WRITE_BACKSPACES (Cmd->cursor)    /* Move cursor back to start */
                    IFX_SHELL_WRITE_SPACES (Cmd->length)    /* Overwrite text with spaces */
                    IFX_SHELL_WRITE_BACKSPACES (Cmd->length)    /* Move cursor back to start */
            }

            Cmd->length = 0;    /* Reset command line length */
            Cmd->cursor = 0;
            Cmd->historyItem = IFX_SHELL_CMD_HISTORY_NO_ITEM;   /* Ensure we are not using list */
        }
        else
        {
            /* Within list - move to more recent entry */
            Cmd->historyItem--;

            /* Copy text into buffer */
            strncpy (cmdStr, shell->cmdHistory[Cmd->historyItem], IFX_SHELL_CMD_LINE_SIZE);

            if (shell->control.echo != 0)
            {
                IFX_SHELL_WRITE_BACKSPACES (Cmd->cursor)    /* Move cursor back to start */
                    IFX_SHELL_WRITE_SPACES (Cmd->length)    /* Overwrite text with spaces */
                    IFX_SHELL_WRITE_BACKSPACES (Cmd->length)    /* Move cursor back to start */
                    IfxStdIf_DPipe_print (shell->io, cmdStr);   /* Copy buffer to screen */
            }

            Cmd->cursor = (Ifx_SizeT) strlen (cmdStr);  /* Store cursor position */
            Cmd->length = Cmd->cursor;  /* Store command line length */
        }

        Cmd->historyAdd = FALSE;
        break;

    case 'C':                  /* Right arrow */

        if (Cmd->cursor < Cmd->length)
        {
            /* Move cursor one place to right */
            IFX_SHELL_IF_ECHO (IfxStdIf_DPipe_print (shell->io, "%c", cmdStr[Cmd->cursor])) Cmd->cursor++;
        }

        break;

    case 'D':                  /* Left arrow */

        if (Cmd->cursor > 0)
        {
            /* Move cursor one place to left */
            IFX_SHELL_IF_ECHO (IfxStdIf_DPipe_print (shell->io, "\b")) Cmd->cursor--;
        }

        break;

    default:
        break;
    }

    /* If second character after ESC [ is ~ then switch on number */
    if (EscapeChar2 == '~')
    {
        switch (EscapeChar1)
        {
        case '1':              /* HOME - move to start of buffer */

            if (Cmd->cursor > 0)
            {
                IFX_SHELL_WRITE_BACKSPACES (Cmd->cursor) Cmd->cursor = 0;
            }

            break;

        case '2':              /* INSERT - insert blank character at cursor and move all remaining characters right one */

            if ((Cmd->cursor < Cmd->length) && (Cmd->length < (IFX_SHELL_CMD_LINE_SIZE - 1)))
            {
                /* Update on screen */
                if (shell->control.echo != FALSE)
                {
                    /* write over duplicated character at cursor */
                    IfxStdIf_DPipe_print (shell->io, " ");

                    /* Update line with new characters */
                    for (i = Cmd->cursor; i < Cmd->length; i++)
                    {
                        IfxStdIf_DPipe_print (shell->io, "%c", cmdStr[i]);
                    }

                    /* Move cursor back to new place */
                IFX_SHELL_WRITE_BACKSPACES ((Cmd->length + 1) - Cmd->cursor)}

                /* Update in command line variable */
                for (i = Cmd->length; i > Cmd->cursor; i--)
                {
                    cmdStr[i] = cmdStr[i - 1];  /* Shuffle text right */
                }

                cmdStr[Cmd->length + 1] = IFX_SHELL_NULL_CHAR;  /* Terminate string at end of longer string */
                cmdStr[Cmd->cursor] = ' ';  /* Blank character at cursor */

                Cmd->length++;  /* Now one character longer */
            }

            break;

        case '3':              /* DELETE - delete character to right and move all remaining characters left one */

            if (Cmd->cursor < Cmd->length)
            {
                /* Update on screen */
                if (shell->control.echo != 0)
                {
                    for (i = Cmd->cursor; i < (Cmd->length - 1); i++)
                    {
                        /* Update line with new characters */
                        IfxStdIf_DPipe_print (shell->io, "%c", cmdStr[i + 1]);
                    }

