realsosy/InfineonRacer/src/InfineonRacer_TC23xA/0_Src/1_SrvSw/SysSe/Comm/Ifx_Shell.c
                    /* write over duplicated character at end */
                    IfxStdIf_DPipe_print (shell->io, " ");

                    /* Move cursor back to right place */
                IFX_SHELL_WRITE_BACKSPACES (Cmd->length - Cmd->cursor)}

                /* Update in command line variable. Shuffle text left */
                strncpy (&cmdStr[Cmd->cursor], &cmdStr[Cmd->cursor + 1], Cmd->length - Cmd->cursor - 1);

                cmdStr[Cmd->length - 1] = IFX_SHELL_NULL_CHAR;  /* Terminate string at end of shorter string */
                Cmd->length--;  /* Now one character shorter */
            }

            break;

        case '4':              /* END - ensure cursor is at end */

            while (Cmd->cursor < Cmd->length)
            {
                IFX_SHELL_IF_ECHO (IfxStdIf_DPipe_print (shell->io, "%c", cmdStr[Cmd->cursor])) Cmd->cursor++;
            }

            break;

        default:
            break;
        }
    }
}


void Ifx_Shell_enable (Ifx_Shell * shell)
{
    // Clear the Rx buffer!
    IfxStdIf_DPipe_clearRx (shell->io);
    // Enable the shell
    shell->control.enabled = 1;
}


void Ifx_Shell_disable (Ifx_Shell * shell)
{
    shell->control.enabled = 0;
}


void Ifx_Shell_printSyntax (const Ifx_Shell_Syntax * syntaxList, IfxStdIf_DPipe * io)
{
    const Ifx_Shell_Syntax *syntax = syntaxList;

    while (syntax->syntax != NULL_PTR)
    {
        IfxStdIf_DPipe_print (io, "Syntax     : %s" ENDL, syntax->syntax);
        IfxStdIf_DPipe_print (io, "           > %s" ENDL, syntax->description);
        syntax = &syntax[1];
    }
}
